Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཞལ་སྲོག་ཆགས་གོ་བའི་མདོག་འདྲ་བར་ཤིན་ཏུ་ངེས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the face being ascertained in the color of a gopa.

source: ཞལ་སྲོག་ཆགས་གོ་བའི་མདོག་ལྟ་བུར་སྤ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as restraint and having a face that is colored like a gopa.

source: ཞལ་གཉེར་མ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as the face being free from wrinkles.

source: ཞལ་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the face being even.

source: ཟླ་བ་དང་ཉི་མའི་འོད་ལྟ་བུར་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the face radiating with an indomitable splendor, like the sun and moon.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཞལ་སྲོག་ཆགས་གོ་བའི་མདོག་ལྟ་བུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that cause the face to assume the color of the gopa animal.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱན་མཐོན་ཏིང་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that accomplish the deep blue color of the eyes?

source: དགའ་བར་འགྱུར་བའི་སྤྱན་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as delightful eyes.

source: སྤྱན་གྱི་དཀྱུས་རིང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline gives the eyes their length.

source: སྤྱན་ལེགས་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes the eyes well formed.

source: སྤྱན་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes the eyes unimpeded.

source: ཐག་རིང་པོར་གཟིགས་པ་དང་འབྲེལ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes them able to see at great distances.

source: མ་ལུས་པ་གཟིགས་ཤིང་མཐའ་ཡས་པར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight makes the eyes able to see everything at infinite distances.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱན་མཐོན་ཏིང་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the bodhisattvas that accomplish the deep blue color of the eyes.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཤངས་མཐོ་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the bodhisattvas’ six perfections that accomplish the prominent nose?

source: ཤངས་མཐོ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as a prominent nose.

source: ཤངས་དཀྱུས་རིང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline gives the nose its length.

source: ཤངས་མདངས་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience gives the nose its luster.

source: ཤངས་ཡིད་དུ་འོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence gives the nose its beauty.

source: མཐོང་ན་དགའ་ལ་ངོམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration gives the nose its captivating beauty.

source: ཡིད་དུ་འཐད་པའི་དྲི་སྣོམ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ། །
en: The perfection of insight ripens such that the experience of scents is agreeable.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤངས་མཐོ་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the bodhisattvas that accomplish the prominent nose.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མཛོད་སྤུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that accomplish the tuft of hair?

source: མཛོད་སྤུ་དཀར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the whiteness of the tuft of hair.

source: མཛོད་སྤུ་གཡས་སུ་འཁྱིལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline makes the tuft of hair curl to the right.

source: མཛོད་སྤུ་སྤ་ཞིང་ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes the tuft of hair strong and overpowering.

source: མཛོད་སྤུ་རིང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence gives the tuft of hair its length.

source: ཤིན་ཏུ་འཁྱིལ་ཅིང་ལེགས་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes the tuft of hair sit beautifully.

source: འོད་མཐའ་ཡས་པས་ཁྱབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight makes the tuft of hair radiate infinite light.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཛོད་སྤུ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the bodhisattvas that accomplish the tuft of hair.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་དབུའི་གཙུག་ཏོར་དང་ལྡན་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the bodhisattvas’ six perfections that accomplish the uṣṇīṣa?

source: མཐོན་ཏིང་འཁྱིལ་བར་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the coiling, dark blue pattern.

source: གཡས་སུ་འཁྱིལ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline makes the uṣṇīṣa hair coil to the right.

source: རྡུལ་གྱིས་མ་གོས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes it immaculate.

source: སྤྱི་གཙུག་བལྟར་མི་མངོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes the crown become imperceptible.

source: རྟག་ཏུ་བལྟ་བར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes it keep attracting the gaze.

source: ཆར་དང་རླུང་གིས་མི་ཤིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight makes the uṣṇīṣa unaffected by rain or wind.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་དབུ་གཙུག་ཏོར་དང་ལྡན་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: In this way, the six perfections of the bodhisattvas accomplish the uṣṇīṣa.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འབྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the bodhisattva’s departure?

source: བར་ཆད་མེད་པར་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the unhindered departure.

source: ཤིན་ཏུ་དུལ་བར་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as perfectly tempered progress.

source: ལྷ་མཐའ་ཡས་པ་དག་ཉེ་བར་འོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes innumerable gods approach.

source: གནོད་སྦྱིན་དག་གིས་སྒོ་གདངས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes the yakṣas open the gates.

source: ནམ་མཁའ་ལ་སྤྱན་དྲངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration is the invitation into the sky.

source: སྐྱེ་བོ་མཛའ་བ་ཐམས་ཅད་ལ་མི་ལྟ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as absence of worry regarding loved ones.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འབྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the bodhisattva’s departure.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་དུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the bodhisattva’s six perfections based on time?

source: ཚལ་མེ་ཏོག་རྒྱས་པའི་དུས་སུ་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as a departure when forests are in bloom.

source: དུས་ཚིགས་ཀྱི་མཆོག་ཏུ་ཕྱིན་པའི་ཚེ་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline allows for a departure in the best of all seasons.

source: རྒྱུ་སྐར་བཟང་པོ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience brings auspicious constellations.

source: སྙོམས་པར་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence creates a smooth departure.

source: ངན་སོང་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the pacification of all the lower realms.

source: ངན་སོང་དུ་སོང་བའི་སེམས་ཅན་ཐམས་ཅད་སྣང་བར་བྱས་ནས་གཅིག་ལ་གཅིག་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight creates understanding concerning all beings in the lower realms and makes them speak to one another.

source: འདི་དག་ནི་དུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections based on time.

source: དེ་ལ་དུས་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections based on knowledge of time?

source: གཉིད་ལོག་པ་ན་ཐུན་ཐ་མ་ལ་རབ་ཏུ་བྱུང་སྟེ། གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as stepping forth and departing during the last watch of night, while everyone is asleep.

source: བདག་ཉིད་རབ་ཏུ་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline causes one to go forth alone.

source: འདུན་པ་ཅན་ལ་བཀའ་སྩལ་ཏེ་བཏང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as speaking to Chandika and sending him off.

source: རབ་ཏུ་བྱུང་བ་ལ་བརྟེན་ནས་ཡུལ་ཀ་ཤི་ཀའི་ན་བཟའ་སྤངས་ཏེཆོས་གོས་བཞེས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes one give up Kāśī silk after stepping forth, and instead wearing the robes of the Dharma.

source: ཐར་པ་ལ་རེག་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration brings one into contact with liberation.

source: ཡུལ་མ་ག་དྷཱའི་བདག་པོ་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་སླད་དུ་གྲོང་ཁྱེར་དུ་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight makes one proceed to the city in order to ripen the ruler of Magadha.

source: འདི་དག་ནི་དུས་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections based on knowledge of time.

source: དེ་ལ་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of discernment?

source: ཐུགས་བརྩེ་བའི་སླད་དུ་རྒྱལ་པོའི་ཁབ་ཏུ་བསོད་སྙོམས་ལ་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as going to Rājagṛha to receive alms with a loving heart.

source: ལྷ་རྣམས་ལ་ཆོས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline makes one teach the Dharma to the gods.

source: རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་ནས་རི་ལ་བཞུགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes one leave for the mountains after having come to Rājagṛha.

source: སྐུ་དྲང་པོར་བཞུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes one sit upright.

source: བསམ་གཏན་ལ་དགོངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes one intent on concentration.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྣམ་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the understanding of dependent origination.

source: འདི་དག་ནི་རྣམ་པར་དབྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of discernment.

source: དེ་ལ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for harmonizing with the world?

source: སློངས་མོ་ལ་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as going on alms rounds.

source: སྒྱུ་རྩལ་ཤེས་ཀྱི་བུ་རིང་དུ་འཕུར་དང་རངས་བྱེད་ཀྱི་བུ་ལྷག་སྤྱོད་ཀྱི་ཐད་དུ་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as going before Āḷāra Kālāma and Udraka Rāma­putra.

source: འདི་ནི་ལམ་མ་ཡིན་ནོ་ཞེས་སྤངས་ནས་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes one think, ‘This is not the path,’ and hence abandon such teachers.

source: ལོ་དྲུག་ཏུ་བཞུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes one practice for six years.

source: མཁའ་ཁྱབ་ཀྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration engenders the concentration that pervades all of space.

source: མི་སྤྱོད་སྙམ་ནས་ཞལ་ཟས་གསོལ་ཏེབྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The ripening of the perfection of insight makes one take food despite having refrained from doing so, and then proceed to the seat of awakening.

source: འདི་དག་ནི་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for harmonizing with the world.

source: དེ་ལ་རྟོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of realization?

source: བདུད་འདུལ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as taming the māras.

source: སྟོང་གསུམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline brings happiness to all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་ཤིང་དམ་བཅས་པ་མི་འདྲལ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes one focus on all beings with unfailing commitment.

source: སྟོང་གསུམ་ལ་སྒྲིབ་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence brings absence of obscuration regarding the trichiliocosm.

source: བསམ་གཏན་བཞི་ལ་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes one enter the meditative attainment of the four concentrations.

source: རིག་པ་གསུམ་རྗེས་སུ་འཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the attainment of the threefold knowledge.

source: འདི་དག་ནི་རྟོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of realization.

source: དེ་ལ་སྤོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of relinquishment?

source: སེར་སྐྱའི་གནས་ན་ལོར་ཉེ་བར་སྙེན་པ་གང་ཡིན་པ་དེ་ནི་སྤོང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on relinquishment is approaching Kapilavastu after years have passed.

source: འགོག་པ་ལ་བརྩོན་ཞིང་ཁམས་གསུམ་ལ་མི་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is resting in cessation and remaining beyond the three realms.

source: མི་སྐྱེ་བ་ལ་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is apprehending nonarising.

source: སེམས་ཅན་ལ་བལྟ་བའི་སྙིང་རྗེ་དང་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is compassion and engagement that consider sentient beings.

source: སྐྱོན་སྤོང་བ་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration is that which accords with aspects of discernment regarding the relinquishing of flaws.

source: ཡན་ལག་བརྒྱད་རབ་ཏུ་ཐོབ་ཅིང་མ་འབགས་ལ་ནག་ནོག་མེད་པའི་ཚུལ་ཁྲིམས་ཅན་འདོད་ཆགས་སྤོང་བའི་ཕྱིར་དང་། མ་རིག་པ་གཞོམ་པའི་ཕྱིར་རིག་པ་སྐྱེད་ཅིང་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པ་སྤོང་བ་ཆེན་པོ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the engendering of knowledge and the great relinquishment that is free from obscurations with respect to all phenomena, which in turn are due to the stainless attainment of the eight limbs of the noble path, the immaculate discipline of giving up desire, and the crushing of ignorance.

source: འདི་དག་ནི་སྤོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of relinquishment.

source: དེ་ལ་རྡོ་རྗེ་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six vajra-like perfections?

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་བསྒྲུབ་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the attainment of the vajra-like absorption.

source: དམིགས་པ་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ensures that the focus is not lost.

source: ཕྱིན་ཅི་མ་ལོག་པར་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is recall free from error.

source: ཐམས་ཅད་དུ་འཐུན་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence brings engagement that is appropriate in all regards.

source: རང་གི་ཡོན་ཏན་ཤེས་ནས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration relinquishes the connectivity of karmic imprints due to knowing one’s own qualities.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་ཤེས་པ་མ་ལུས་པར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as perfect awakening with respect to all the intentions and thoughts of all sentient beings.

source: འདི་དག་ནི་རྡོ་རྗེ་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six vajra-like perfections.

source: དེ་ལ་མུན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of freedom from darkness?

source: བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ན། གང་དག་ལྷ་རྣམས་འཇིག་རྟེན་གྱི་མགོན་པོ་རྒྱལ་བར་གྱུར་ཅིག་རྒྱལ་བར་གྱུར་ཅིག་ཅེས་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens so that upon awakening to perfect buddhahood, the gods cry out, ‘May the protector of the world be victorious! May he be victorious!’

source: ངན་སོང་རབ་ཏུ་ཞི་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline quells the lower realms.

source: དབང་པོ་ཚང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes the faculties complete.

source: སེམས་ཅན་རྣམས་ལ་ཉོན་མོངས་པའི་མི་གནོད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes sentient beings remain unharmed by the defilements.

source: སིལ་སྙན་མ་དཀྲོལ་བར་སྒྲ་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration creates the sound of cymbals although no one plays them.

source: སྟོང་གསུམ་དུ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པ་དང་། ལྷ་རྣམས་ཀུན་དགའ་བའི་སྒྲ་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight causes generosity and meritorious actions throughout the trichiliocosm, and it makes the gods call out in joy.

source: འདི་དག་ནི་མུན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of freedom from darkness.

source: དེ་ལ་ཟིལ་གྱིས་མི་ནོན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of being indomitable?

source: སྟོང་གསུམ་དག་ན་ཤིང་ལྗོན་པ་དག་ལས་དུས་མ་ཡིན་པར་མེ་ཏོག་དང་འབྲས་བུ་དག་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens such that trees grow flowers and fruits out of season.

source: སེམས་ཅན་རྣམས་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཐམས་ཅད་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline frees all beings from sensations of pain.

source: སེམས་ཅན་ཐམས་ཅད་ཤིན་ཏུ་དབང་པོ་ཚང་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes the faculties of all sentient beings perfectly complete.

source: ལག་མཐིལ་ནས་ཉེ་བར་བཟུང་སྟེ་སྟོང་གསུམ་དག་ན་བླ་ན་མེད་པ་བཅུ་ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes one indomitable in the ten unsurpassable factors throughout the trichiliocosm, having received them with the palms of one’s hands.

source: གཅིག་ལ་གཅིག་བསྔགས་པ་མང་པོ་རྗོད་ཅིང་ལྷ་རྣམས་ལ་བདུད་རྩི་སྟོབས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes the gods lavish praises upon each other and offer one another elixir.

source: བདུད་བཞི་བཅོམ་པ་དང་མི་མཉམ་པ་དང་མཉམ་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as conquest of the four māras and awakening to buddhahood—the highest wisdom.

source: འདི་དག་ནི་ཟིལ་གྱིས་མི་ནོན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of being indomitable.

source: དེ་ལ་བདུད་ཀྱི་དཔུང་འཇོམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that conquer the hordes of the māras?

source: སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ན། སེམས་ཅན་ཐམས་ཅད་བཀྲེས་པ་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens so that upon awakening to perfect buddhahood, all beings in the trichiliocosm are freed from hunger.

source: ཉོན་མོངས་པའི་བདུད་སུ་ལ་ཡང་གནོད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline renders every māra of the defilements harmless.

source: ལྷའི་བུའི་བདུད་སུ་ལ་ཡང་གནོད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience renders every deity māra of the deities harmless.

source: འཆི་བདག་གི་བདུད་སུ་ལ་ཡང་གནོད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence renders every māra of the Lord of Death harmless.

source: ཕུང་པོའི་བདུད་སུ་ལ་ཡང་གནོད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes every māra of the aggregates harmless.

source: དགོངས་པ་ཇི་ལྟ་བ་བཞིན་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as perfect buddhahood and omniscience just as it was intended.

source: འདི་དག་ནི་བདུད་ཀྱི་དཔུང་འཇོམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that conquer the hordes of the māras.

source: དེ་ལ་གཡོ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of immutability?

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སྐྱིལ་མོ་ཀྲུང་བཅས་པ་ལ་སྐྱོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as freedom from weariness when seated cross-legged at the seat of awakening.

source: བདུད་མཐོང་ན་འཇིགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline makes one fearless at the sight of the māras.

source: ལུས་ལ་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes one apprehend the body.

source: སེམས་ལ་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes one apprehend the mind.

source: དམ་བཅས་པ་ལས་གཞན་དུ་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes one’s commitment unwavering.

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the ability to do exactly what one said one would for the sake of awakening.

source: འདི་དག་ནི་གཡོ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of immutability.

source: དེ་ལ་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the single unique moment?

source: སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སེམས་དེའི་སྦྱོར་བ་ཉེ་བར་བསྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as accomplishment of the mind that aspires to awaken to unsurpassed and perfect buddhahood through a single moment of insight.

source: གཉེན་པོས་འཇོམས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline makes the remedy destroy the impediment.

source: ང་རྒྱལ་ཀུན་ཏུ་འཇོམས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience conquers pride.

source: གཞན་གྱི་བསམ་པ་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence brings understanding of the equality of the thoughts of others.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration yields understanding of dependent origination.

source: ཆོས་ཐམས་ཅད་ལ་དུས་གསུམ་དུ་མ་བརྗེད་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the attainment of not forgetting with respect to all phenomena in the three times.

source: འདི་དག་ནི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the single unique moment.

source: དེ་ལ་མཉམ་པར་མ་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections without equipoise?

source: ཤའི་མིག་གིས་སེམས་ཅན་རྣམས་ལ་གཟིགས་ནས་སྡུག་བསྔལ་བར་གྱུར་པ་རྣམས་ལ་བདེ་བ་ཉེ་བར་བསྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as seeing all sentient beings with the physical eye and providing those who suffer with happiness.

source: ལྷའི་མིག་གིས་དར་བ་དང་རྒུད་པ་གཟིགས་ནས་འཇིག་རྟེན་གྱི་ཐར་པ་ཉེ་བར་བསྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline makes one see flourishing and decline by means of the divine eye and accomplish the liberation of the world.

source: ཉན་ཐོས་རྣམ་པར་འཇོག་ཅིང་གཞན་ལ་བརྩེ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes hearers rest and have love for others.

source: རྫུ་འཕྲུལ་དང་ཆོ་འཕྲུལ་ཉེ་བར་བསྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence brings the accomplishment of miraculous feats and displays.

source: སེམས་ཀྱིས་ལྷའི་སེམས་གཟིགས་ནས་ཆོས་སྟོན་པ་ནི་དཔེར་ན་བྲམ་ཟེ་ལྷའི་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes one mentally perceive the minds of gods and teach them the Dharma, just as in the case of the brahmin Devaputra.

source: དུས་མཁྱེན་པ་སྨོན་ནས་ཤེས་པས་ཆོས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the teaching of Dharma through knowledge of time and knowledge attained in accordance with one’s wishes.

source: འདི་དག་ནི་མཉམ་པར་མ་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections without equipoise.

source: དེ་ལ་མཉམ་པར་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of equipoise?
